ðŸŸ¦ 1. Import Libraries

In [1]:
import pandas as pd

ðŸŸ¦ 2. Create Sample DataFrame

In [5]:
data = {
    "First Name": ["Alice", "Bob", "Charlie"],
    "Last Name": ["Smith", "Brown", "Johnson"],
    "Annual Salary ($)": [70000, 80000, 90000],
    "City Name": ["Toronto", "Vancouver", "Montreal"]
}

df = pd.DataFrame(data)
df

  First Name Last Name  Annual Salary ($)  City Name
0      Alice     Smith              70000    Toronto
1        Bob     Brown              80000  Vancouver
2    Charlie   Johnson              90000   Montreal

ðŸŸ¦ 3. Rename Individual Columns

In [6]:
df.rename(columns={"First Name": "first_name"}, inplace=True)
df

  first_name Last Name  Annual Salary ($)  City Name
0      Alice     Smith              70000    Toronto
1        Bob     Brown              80000  Vancouver
2    Charlie   Johnson              90000   Montreal

ðŸŸ¦ 4. Rename Multiple Columns at Once

In [9]:
df.rename(columns={
    "Last Name": "last_name",
    "Annual Salary ($)": "salary",
    "City Name": "city"
}, inplace=True)

df

  first_name last_name  salary       city
0      Alice     Smith   70000    Toronto
1        Bob     Brown   80000  Vancouver
2    Charlie   Johnson   90000   Montreal

ðŸŸ¦ 5. Rename All Columns Using Lambda (Cleaning)

5.1 Convert to lowercase, replace spaces with underscores.

In [10]:
df = pd.DataFrame(data)

df.columns = df.columns.str.lower().str.replace(" ", "_")
df

  first_name last_name  annual_salary_($)  city_name
0      Alice     Smith              70000    Toronto
1        Bob     Brown              80000  Vancouver
2    Charlie   Johnson              90000   Montreal

5.2 Remove special characters like $ and parentheses

In [11]:
df.columns = df.columns.str.replace(r"[^\w]+", "", regex=True)
df

  first_name last_name  annual_salary_  city_name
0      Alice     Smith           70000    Toronto
1        Bob     Brown           80000  Vancouver
2    Charlie   Johnson           90000   Montreal

ðŸŸ¦ 6. Advanced Column Name Cleaning (Fully Automated)

In [30]:
df = pd.DataFrame(data)

def clean_columns(columns):
    return (
        columns
        .str.strip()
        .str.lower()
        .str.replace(" ", "_")
        .str.replace(r"[^\w]", "", regex=True)
    )

df.columns = clean_columns(df.columns)
df

  first_name last_name  annual_salary_  city_name
0      Alice     Smith           70000    Toronto
1        Bob     Brown           80000  Vancouver
2    Charlie   Johnson           90000   Montreal

ðŸŸ¦ 7. Rename Index Labels

In [31]:
df.index = ["row_1", "row_2", "row_3"]
df

      first_name last_name  annual_salary_  city_name
row_1      Alice     Smith           70000    Toronto
row_2        Bob     Brown           80000  Vancouver
row_3    Charlie   Johnson           90000   Montreal

In [32]:
df.rename(index={
    "row_1": "first",
    "row_2": "second"
}, inplace=True)
df

       first_name last_name  annual_salary_  city_name
first       Alice     Smith           70000    Toronto
second        Bob     Brown           80000  Vancouver
row_3     Charlie   Johnson           90000   Montreal

ðŸŸ¦ 8. Rename Columns Programmatically Using Loop

In [33]:
df.columns = ["col_" + col for col in df.columns]
df

       col_first_name col_last_name  col_annual_salary_ col_city_name
first           Alice         Smith               70000       Toronto
second            Bob         Brown               80000     Vancouver
row_3         Charlie       Johnson               90000      Montreal

ðŸŸ¦ 9. Using set_axis() (Alternative Method)

In [34]:
df = df.set_axis(["A", "B", "C", "D"], axis=1)
df

              A        B      C          D
first     Alice    Smith  70000    Toronto
second      Bob    Brown  80000  Vancouver
row_3   Charlie  Johnson  90000   Montreal

ðŸŸ¦ 10. Rename MultiIndex Columns

If your project expands to advanced multi-level columns

In [27]:
arrays = [
    ["Personal", "Personal", "Finance", "Finance"],
    ["First", "Last", "Salary", "City"]
]

df_multi = pd.DataFrame([[1,2,3,4]], columns=pd.MultiIndex.from_arrays(arrays))
df_multi

  Personal      Finance
     First Last  Salary City
0        1    2       3    4

ðŸŸ¦ 11. Rename using Dictionary Mapping

In [35]:
mapping = {
    "A": "fname",
    "B": "lname",
    "C": "income",
    "D": "location"
}

df.rename(columns=mapping, inplace=True)
df

          fname    lname  income   location
first     Alice    Smith   70000    Toronto
second      Bob    Brown   80000  Vancouver
row_3   Charlie  Johnson   90000   Montreal

### ðŸŸ¦ Summary â€” Renaming Columns

In this subsection, you learned how to:

- Rename individual columns using `rename()`
- Rename multiple columns at once using dictionaries
- Clean and format column names using string operations and lambda functions
- Create reusable functions for consistent column formatting
- Rename index labels
- Programmatically rename columns using loops
- Use `set_axis()` as an alternative method
- Rename MultiIndex columns